DataProcessors/ЗагрузкаКоммитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКоммитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Коммиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПочтаАвтора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКоммита</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХЭШ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобщениеКоммита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ветка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коммит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Коммиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Коммиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Коммиты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Ветки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаАвтора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоммита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХЭШ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобщениеКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаКоммитов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьКоммиты(Команда)
    Попытка
        ЗагрузитьКоммитыНаСервере();
        Сообщить("✅ Готово!");
    Исключение
        Сообщить(" Ошибка: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКоммитыНаСервере()
    
    URLРепозитория = "https://github.com/Bl1nke/save-logs.git";
    ИмяВетки = "main";
    ЛокальнаяПапка = "C:\temp\myrepo";
    ПутьКGit = "C:\Program Files\Git\bin\git.exe";
    
    // Проверка git
    Если НЕ ФайлСуществует(ПутьКGit) Тогда
        Сообщить("Git не найден");
        Возврат;
    КонецЕсли;
    
    // Создание папки
    Если НЕ ФайлСуществует("C:\temp") Тогда
        СоздатьКаталог("C:\temp");
    КонецЕсли;
    
    // Клонирование или обновление
    Если ФайлСуществует(ЛокальнаяПапка + "\.git") Тогда
        ВыполнитьGitКоманду(ПутьКGit, "fetch --all", ЛокальнаяПапка);
    Иначе
        ВыполнитьGitКоманду(ПутьКGit, "clone """ + URLРепозитория + """ """ + ЛокальнаяПапка + """", "C:\temp");
    КонецЕсли;
    
    // Получение коммитов
    ТекстКоммитов = ПолучитьКоммиты(ПутьКGit, ЛокальнаяПапка, ИмяВетки);
    
    Если ПустаяСтрока(ТекстКоммитов) Тогда
        Сообщить("Нет коммитов");
        Возврат;
    КонецЕсли;
    
    // Находим или создаем ветку
    СсылкаНаВетку = НайтиИлиСоздатьВетку(ИмяВетки, URLРепозитория);
    
    Если СсылкаНаВетку = Неопределено Тогда
        Сообщить("❌ Не удалось получить ссылку на ветку");
        Возврат;
    КонецЕсли;
    
    // Сохранение в базу с ссылкой на ветку
    СохранитьКоммиты(ТекстКоммитов, СсылкаНаВетку);
    
КонецПроцедуры

&НаСервере
Функция НайтиИлиСоздатьВетку(ИмяВетки, URLРепозитория)
    
    // Ищем существующую ветку
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Ветки.Ссылка
        |ИЗ
        |    Справочник.Ветки КАК Ветки
        |ГДЕ
        |    Ветки.Наименование = &ИмяВетки";
    
    Запрос.УстановитьПараметр("ИмяВетки", ИмяВетки);
    Результат = Запрос.Выполнить().Выгрузить();
    
    Если Результат.Количество() > 0 Тогда
        Сообщить("✓ Найдена ветка: " + ИмяВетки);
        Возврат Результат[0].Ссылка;
    КонецЕсли;
    
    // Создаем новую ветку
    Попытка
        НоваяВетка = Справочники.Ветки.СоздатьЭлемент();
        НоваяВетка.Наименование = ИмяВетки;
        
        // Проверяем, есть ли реквизит ПутьКУдаленномуРепозиторию
        Если НоваяВетка.Метаданные().Реквизиты.Найти("ПутьКУдаленномуРепозиторию") <> Неопределено Тогда
            НоваяВетка.ПутьКУдаленномуРепозиторию = URLРепозитория;
        КонецЕсли;
        
        НоваяВетка.Записать();
        Сообщить("✓ Создана ветка: " + ИмяВетки);
        Возврат НоваяВетка.Ссылка;
    Исключение
        Сообщить("❌ Ошибка создания ветки: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

&НаСервере
Функция ФайлСуществует(Путь)
    Попытка
        Файл = Новый Файл(Путь);
        Возврат Файл.Существует();
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции

&НаСервере
Процедура ВыполнитьGitКоманду(ПутьКGit, Команда, Папка)
    ЗапуститьПриложение("""" + ПутьКGit + """ " + Команда, Папка, Истина, 60000);
КонецПроцедуры

&НаСервере
Функция ПолучитьКоммиты(ПутьКGit, Папка, Ветка)
    ВремФайл = ПолучитьИмяВременногоФайла("txt");
    BatФайл = ПолучитьИмяВременногоФайла("bat");
    
    ТекстBat = "@echo off" + Символы.ПС + 
               """" + ПутьКGit + """ log " + Ветка + 
               " --pretty=format:""%%H|%%an|%%ae|%%aI""" + 
               " > """ + ВремФайл + """ 2>&1";
    
    Запись = Новый ЗаписьТекста(BatФайл, КодировкаТекста.UTF8);
    Запись.Записать(ТекстBat);
    Запись.Закрыть();
    
    ЗапуститьПриложение(BatФайл, Папка, Истина, 60000);
    
    Если ФайлСуществует(ВремФайл) Тогда
        Чтение = Новый ЧтениеТекста(ВремФайл, КодировкаТекста.UTF8);
        Результат = Чтение.Прочитать();
        Чтение.Закрыть();
    Иначе
        Результат = "";
    КонецЕсли;
    
    УдалитьФайлы(ВремФайл);
    УдалитьФайлы(BatФайл);
    
    Возврат Результат;
КонецФункции

&НаСервере
Процедура СохранитьКоммиты(ТекстКоммитов, СсылкаНаВетку)
    
    Сообщить("=== ОТЛАДКА СОХРАНЕНИЯ ===");
    Сообщить("СсылкаНаВетку = " + Строка(СсылкаНаВетку));
    Сообщить("ТипЗнч(СсылкаНаВетку) = " + ТипЗнч(СсылкаНаВетку));
    
    // Пытаемся создать тестовый коммит БЕЗ git данных
    Попытка
        ТестКоммит = Справочники.Коммиты.СоздатьЭлемент();
        ТестКоммит.Наименование = "ТЕСТ";
        ТестКоммит.Автор = "ТЕСТ";
        ТестКоммит.ПочтаАвтора = "test@test.ru";
        ТестКоммит.ХЭШ = "test123";
        ТестКоммит.ДатаКоммита = ТекущаяДата();
        ТестКоммит.Владелец = СсылкаНаВетку;
        ТестКоммит.Записать();
        Сообщить("✓ Тестовый коммит создан успешно!");
    Исключение
        Сообщить("❌ Ошибка создания тестового коммита: " + ОписаниеОшибки());
    КонецПопытки;
    
    // Если тест прошел, продолжаем с реальными данными
    Строки = СтрРазделить(ТекстКоммитов, Символы.ПС);
    Создано = 0;
    
    Для Каждого стр Из Строки Цикл
        стр = СокрЛП(стр);
        Если ПустаяСтрока(стр) Тогда Продолжить; КонецЕсли;
        
        Части = СтрРазделить(стр, "|");
        Если Части.Количество() < 4 Тогда Продолжить; КонецЕсли;
        
        Хэш = СокрЛП(Части[0]);
        Автор = СокрЛП(Части[1]);
        Почта = СокрЛП(Части[2]);
        ДатаСтр = СокрЛП(Части[3]);
        
        Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК К ИЗ Справочник.Коммиты ГДЕ ХЭШ = &Х";
        Запрос.УстановитьПараметр("Х", Хэш);
        Если Запрос.Выполнить().Выгрузить()[0].К > 0 Тогда
            Продолжить;
        КонецЕсли;
        
        Попытка
            Коммит = Справочники.Коммиты.СоздатьЭлемент();
            Коммит.Наименование = Хэш;
            Коммит.Автор = Автор;
            Коммит.ПочтаАвтора = Почта;
            Коммит.ХЭШ = Хэш;
            Коммит.ДатаКоммита = РаспарситьДату(ДатаСтр);
            Коммит.Владелец = СсылкаНаВетку;
            Коммит.Записать();
            Создано = Создано + 1;
        Исключение
            Сообщить(" Ошибка коммита " + Лев(Хэш, 8) + ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
    
    Сообщить("Создано коммитов: " + Создано);
КонецПроцедуры
&НаСервере
Функция РаспарситьДату(СтрДата)
    Попытка
        // Убираем часовой пояс
        Поз = СтрНайти(СтрДата, "+");
        Если Поз > 0 Тогда
            СтрДата = Лев(СтрДата, Поз - 1);
        КонецЕсли;
        
        СтрДата = СтрЗаменить(СтрДата, "T", " ");
        
        Г = Число(Лев(СтрДата, 4));
        М = Число(Сред(СтрДата, 6, 2));
        Д = Число(Сред(СтрДата, 9, 2));
        Ч = Число(Сред(СтрДата, 12, 2));
        Мин = Число(Сред(СтрДата, 15, 2));
        Сек = Число(Сред(СтрДата, 18, 2));
        
        Возврат Дата(Г, М, Д, Ч, Мин, Сек);
    Исключение
        Возврат ТекущаяДата();
    КонецПопытки;
КонецФункции
